Tekla Open API Reference for Tekla Structures 2025
Events.Register Method
 Registers the instance to listen to the specified events.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Register()
Public Sub Register
Implements
IUIEvents.Register()
Exceptions
Exception | Condition
InvalidOperationException | Thrown if attempting registration when already registered.
See Also
Reference
Events Class
Tekla.Structures.Drawing.UI Namespace